Revit 2027 API
ParameterTypeId.FbxLightSpotBeamAngle Property
 "Spot Beam Angle"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FbxLightSpotBeamAngle { get; }
Public Shared ReadOnly Property FbxLightSpotBeamAngle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FbxLightSpotBeamAngle {
	ForgeTypeId^ get ();
}
static member FbxLightSpotBeamAngle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace